tocache/Microchip-PIC18F4550/UPC Microcontroladores 2019-2/Semana 10/EL54_Semana10.X/test_lcd3.c
//Este es un comentario
/*Este es otro comentario*/
#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config FOSC = XTPLL_XT  // Oscillator Selection bits (XT oscillator, PLL enabled (XTPLL))
#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)

#include <xc.h>
#include "LCD.h"
#define _XTAL_FREQ 48000000UL   //Frecuencia de trabajo)

unsigned int cuenta = 0;
unsigned int millar = 0;
unsigned int centena = 0;
unsigned int decena = 0;
unsigned int unidad = 0;
unsigned int conversion = 0;

unsigned int digitos(numero){
    millar = numero / 1000;
    centena = (numero - (millar * 1000)) / 100;
    decena = ((numero - (millar * 1000)) - (centena * 100)) / 10;
    unidad = ((numero - (millar * 1000)) - (centena * 100)) - (decena * 10);
}

void configura_lcd(void){
    TRISD = 0x00;
    __delay_ms(10);
    LCD_CONFIG();
    __delay_ms(15);
    BORRAR_LCD();
    CURSOR_ONOFF(OFF);
    CURSOR_HOME();
}

void main(void) {
    configura_lcd();
    ESCRIBE_MENSAJE("Hola mundo!", 11);
    POS_CURSOR(2,0);
    ESCRIBE_MENSAJE("Canal AN0:", 10);
    ADCON2 = 0x91;              // 4TAD FOsc/64 y Justificacion a la derecha
    ADCON1 = 0x0E;              // AN0 habilitado
    ADCON0 = 0x01;              //Para encender el modulo A/D
    while(1){
        ADCON0bits.GO = 1;      //Inicie la conversion el A/D en el canal AN0
        while(ADCON0bits.GO);
        conversion = ADRESH << 8;
        conversion = conversion + ADRESL;
        digitos(conversion);
        POS_CURSOR(2,10);
        ENVIA_CHAR(millar+0x30);
        ENVIA_CHAR(centena+0x30);
        ENVIA_CHAR(decena+0x30);
        ENVIA_CHAR(unidad+0x30);        
    }
}
